{
    "Restarting-Server": "Restarting-Server is recommended. because it resets connection. Restarting-Server should solve the issue. because it would restore all operations. Restarting-Server would be a option. Because rebooting should reboot the network.",
    "Wikipedia": "Wikipedia is a free online encyclopedia, created and edited by volunteers around the world and hosted. Wikipedia Foundation host it.",
    "Disabling-firewall": "Disabling-firewall is recommended. because firewall could be blocking the connection. Disabling-firewall would be the solution. because firewalls can interrupt networks. Disabling-firewall should be able to solve your issue. because this connection could get disabled by firewall.",
    "Drive-letter":"Drive-letter should be unique. because it is invalid using an existing letter. Drive-letter must be unused letter. because to prevent conflicts. Drive-letter need to be unequaled. because the otherwise can cause errors.",
    "Check-spellings":"Check-spellings of the drive or directory. because name should be correctly spelled. Check-spellings of the name. because drive or directory name must be exact. Check-spellings to make sure. because error is related drive or directory name.",
    "Try-again": "Try-again after a reboot. because this could be a one time error. Try-again few minutes later. because this is not a system issue. Try-again after a few minutes. because this seems to be a minor delay.",
    "Configure-server": "Configure-server to work properly. because problem is in the server-side. Configure-server by contacting the administrator. because issue seems to be in server-side. Configure-server from the server-side. because server is not configured correctly.",
    "Shared-name": "Shared-name must be unique. because used names can cause conflicts. Shared-name have to be a unused name. because to prevent conflicting issues. Shared-name should be unique. because pre-owned names can overlap.  Shared-name should be avoiding naming conflicts. because it is already used in the network.",
    "Reconnect-printer": "Reconnect-printer to the pc correctly. because this seemed to be a connector issue. Reconnect-printer properly. because this issue not in windows. Reconnect-printer and issue will be solved. because problem with the connection, Reconnect-printer correctly. because this is a separate problem.",
    "Queue-name": "Queue-name should be changed. because the name should be unique. Queue-name have to be new. because it has to avoid conflicts. Queue-name must be unequaled. because to keep separate queues. Queue-name has to kept different. because to avoid errors.",
    "Printer-queue": "Printer-queue have to be emptied. because it is full. Printer-queue has overloaded. because it has too many queues. Printer-queue may be full. because files are stuck. Printer-queue should be cleared. because it has friezed.",
    "Correct-printer": "Correct-printer should be chosen. because it is not connected. Correct-printer have to be selected from the list. because this printer does not exists. Correct-printer selection is advised. because printer selection is wrong.",
    "Hardware-issue": "Hardware-issue could cause this problem. because this is not a windows issue. Hardware-issue have to be causing this error. because system seems to has no errors. Hardware-issue must be solved. because there could be a fault in hardware.",
    "Contact-techsupport": "Contact-techsupport to solve this issue. because software error has occurred. Contact-techsupport for this type of problem. because seems to be a software failure. Contact-techsupport immediately. because software issue must be the error.",
    "User/Group-name": "User/Group-name have to be unused. because to avoid issues. User/Group-name must be unique. because this is a naming conflict. User/Group-name should be changed. because the same name can't repeat.  User/Group-name is the problem. because name seems repeated.",
    "Correct-password": "Correct-password should be entered. because credentials are invalid. Correct-password entering would solve you issue. because password is wrong. Correct-password has to be the solution. because password was invalid.",
    "Reconnect-connection": "Reconnect-connection to continue. because seems to be a connection error. Reconnect-connection would solve the issue. because issue is in the connection. Reconnect-connection manually. because this is not a windows issue.",
    "Malfunctioning-cable": "Malfunctioning-cable could cause the issue. because no issue in the windows. Malfunctioning-cable have to be replaced. because this is a hardware issue. Malfunctioning-cable replacement recommended. because no system errors.",
    "Reset-router": "Reset-router is recommended. because it's a router issue. Reset-router should solve the issue. because connection issue occurred. Reset-router manually. because this is not a windows problem.",
    "Configuration-file": "Configuration-file should be corrected. because a file seems to be corrupted. Configuration-file cannot be accessed. because it seems to have invalid data. Configuration-file correction recommended. because some file are invalid.",
    "Realated-programs": "Realated-programs should be closed. because a application is interfering. Realated-programs disabling is advised. because this is a conflict issue. Realated-programs have to be shutdown. because this connection is in use.",
    "Computer-name": "Computer-name should be changed. because it should be unique in a network. Computer-name must be the issue. because network seems to have a naming conflict. Computer-name have to be unique. because to work in a network.",
    "Restore-files": "Restore-files have to be done. because files are missing. Restore-files is needed. because missing content mignt be the problem. Restore-files using third party app. because files could be missing. Restore-files would solve the issue. because some file are missing.",
    "Recheck-path": "Recheck-path to solve the issue. because path could be invalid. Recheck-path to correct it. because path should be valid. Recheck-path to verify the path. because path might be wrong. Recheck-path to continue. because path could be wrong.",
    "Corrupted-files": "Corrupted-files have to be reparied. because this a curruption issue. Corrupted-files could cause the issue. because files cannot be accessed. Corrupted-files should be te issue. because unable to open files. Corrupted-files must be fixed. because files are corrupted.",
    "Malware-infection": "Malware-infection could be the issue. because this is a unusual condition. Malware-infection might be causing the issue. because this is a virus problem. Malware-infection has to be removed. because this is a abnormal condition.",
    "Damaged-drive": "Damaged-drive should be the issue. because this is a hardware problem. Damaged-drive could cause this issue. because this is not in software level. Damaged-drive have to be reparied. because hardware damage could be the cause. Damaged-drive should be fixed. because this a hardware level error.",
    "Active-files": "Active-files is the issue. because files have to be closed. Active-files could cause this issue. because there are running files. Active-files should be closed. because that would solve the issue.",
    "USB-port": "USB-port could be the issue. because port is faulty. USB-port has been damaged. because this is not a system issue. USB-port might be faulty. because port is not working well. USB-port has a problem. because port is damaged.",
    "External-device": "External-device could be the issue. because device is faulty. External-device has been damaged. because this might not be a system issue. External-device might be faulty. because device is not working well. USB-port has a hardware problem. because device is damaged.",
    "Reconnect-drive": "Reconnect-drive to fix the problem. because this could be a connection issue. Reconnect-drive could be the solution. because external drive is not working. Reconnect-drive externally. because this is not a system issue.",
    "Invalid-credentials": "Invalid-credentials could cause this error. because user credetials are incorrect. Invalid-credentials have to be the issue. because credentials should be correct. Invalid-credentials have recognized. because this is a access issue.",
    "User-name": "User-name should be changed. because the name should be unique. User-name have to be new. because it has to avoid conflicts. User-name must be unequaled. because to keep seperate queues. User-name has to kept diffrent. because to avoid errors.",
    "Password-protection": "Password-protection could be the issue. because this could be protected. Password-protection should cause this issue. because this is a access issue. Password-protection has occured. because this is a permission issue."
}